podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USB0_MK28F15.svd.xml
            <register>
               <name>ERREN</name>
               <description>Error Interrupt Enable Register</description>
               <addressOffset>0x8C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PIDERREN</name>
                     <description>PID Error interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="PIDERREN" > <name>CRC5EOFEN</name> <description>CRC5/EOF Error interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="PIDERREN" > <name>CRC16EN</name> <description>CRC16 Error interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="PIDERREN" > <name>DFN8EN</name> <description>Data format invalid interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="PIDERREN" > <name>BTOERREN</name> <description>Bus turnaround error interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="PIDERREN" > <name>DMAERREN</name> <description>DMA error interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="PIDERREN" > <name>OWNERREN</name> <description>OWNERR Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="PIDERREN" > <name>BTSERREN</name> <description>Bit stuff error interrupt Enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>STAT</name>
               <description>Status Register</description>
               <addressOffset>0x90</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ODD</name>
                     <description>Buffer ODD/EVEN\n
Indicates if the last buffer descriptor updated was in the odd bank of the BDT</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Even</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Odd</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX</name>
                     <description>Transmit Indicator\n
Indicates if the most recent transaction was a transmit operation</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Receive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transmit</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENDP</name>
                     <description>Endpoint address\n
This four-bit field encodes the endpoint address that received or transmitted the previous token.\n
This allows the processor core to determine the BDT entry that was updated by the last USB transaction</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTL</name>
               <description>Control Register</description>
               <addressOffset>0x94</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>USBENSOFEN</name>
                     <description>USB Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Module disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Module enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ODDRST</name>
                     <description>Odd Reset\n
Setting this bit to 1 resets all the BDT ODD ping/pong fields to 0, which then specifies the EVEN BDT bank</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Inactive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Active</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ODDRST" > <name>RESUME</name> <description>Resume signalling\n
When set to 1 this bit enables the USB Module to execute resume signaling.\n
This allows the USB Module to perform remote wake-up</description> <bitOffset>2</bitOffset> </field>
                  <field>
                     <name>HOSTMODEEN</name>
                     <description>Host mode enable\n
When set to 1, this bit enables the USB Module to operate in Host mode</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Device Mode</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Host Mode</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESET</name>
                     <description>Reset signalling\n
Setting this bit enables the USB Module to generate USB reset signalling. \n
This allows the USB Module to reset USB peripherals</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Inactive</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset devices</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TXSUSPENDTOKENBUSY</name>
                     <description>Token Busy\n
In Host mode, TOKEN_BUSY is set when the USB module is busy executing a USB token</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Idle</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Busy expecting token</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SE0</name>
                     <description>SE0 indication from bus\n
Live USB Single Ended Zero signal</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>SE0 false</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>SE0 true</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>JSTATE</name>
                     <description>JSTATE indication from bus\n
Live USB differential receiver JSTATE signal</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>KSTATE</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>JSTATE</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ADDR</name>
               <description>Address Register</description>
               <addressOffset>0x98</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ADDR</name>
                     <description>USB Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>LSEN</name>
                     <description>Low Speed Enable bit\n
This bit informs the USB Module that the next token command written to the token register must be performed at low speed.
This enables the USB Module to perform the necessary preamble required for low-speed data transmissions</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>High speed</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Low speed</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDTPAGE1</name>
               <description>BDT Page Register 1\n
Address bits 15 through 9 of the BDT base address</description>
               <addressOffset>0x9C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BDTBA</name>
                     <description>BDT base address[15:9]</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRMNUML</name>
               <description>Frame Number Register Low</description>
               <addressOffset>0xA0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>FRM</name>
                     <description>Frame Number[7:0]\n
Bits [7:0] of the current Frame number from SOF token</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>FRMNUMH</name>
               <description>Frame Number Register High</description>
               <addressOffset>0xA4</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>FRM</name>
                     <description>Frame Number[10:9]\n
Bits [10:9] of the current Frame number from SOF token</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TOKEN</name>
               <description>Token Register\n
In Host mode the Token-pid and Token-endpoint values are written to this register to perform a transaction</description>
               <addressOffset>0xA8</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TOKENENDPT</name>
                     <description>Endpoint address\n
Holds the Endpoint address for the token command. The four bit value written must be a valid endpoint</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TOKENPID</name>
                     <description>Token type (PID)\n
Contains the token type executed by the USB module</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0001</name>
                           <description>OUT Token - USB Module performs an OUT (TX) transaction</description>
                           <value>0b0001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1001</name>
                           <description>IN Token - USB Module performs an IN (RX) transaction</description>
                           <value>0b1001</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1101</name>
                           <description>SETUP Token - USB Module performs a SETUP (TX) transaction</description>
                           <value>0b1101</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SOFTHLD</name>
               <description>SOF Threshold Register</description>
               <addressOffset>0xAC</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CNT</name>
                     <description>Threshold in byte times\nRepresents the SOF count threshold in byte times</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDTPAGE2</name>
               <description>BDT Page Register 2\n
Address bits 23 through 16 of the BDT base address</description>
               <addressOffset>0xB0</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BDTBA</name>
                     <description>BDT base address[23:16]</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>BDTPAGE3</name>
               <description>BDT Page Register 3\n
Address bits 31 through 24 of the BDT base address</description>
               <addressOffset>0xB4</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BDTBA</name>
                     <description>BDT base address[7:0]</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
