podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USB0_MK28F15.svd.xml
            <cluster>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15</dimIndex>
               <name>ENDPOINT,@p@f@i</name>
               <addressOffset>0xC0</addressOffset>
               <register>
                  <name>ENDPT</name>
                  <description>Endpoint Control Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>8</size>
                  <resetMask>0xFF</resetMask>
                  <fields>
                     <field>
                        <name>EPHSHK</name>
                        <description>Handshake enable\n
This bit enables an endpoint to perform handshaking during a transaction.\n
This bit is generally 1 unless the endpoint is Isochronous</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field derivedFrom="EPHSHK" > <name>EPSTALL</name> <description>Endpoint Stall\n
When set this bit indicates that the endpoint is stalled. 
This bit has priority over all other control bits in the EndPoint Enable Register, but it is only valid if EPTXEN=1 or EPRXEN=1.\n
Any access to this endpoint causes the USB Module to return a STALL handshake.\n
After an endpoint is stalled it requires intervention from the Host Controller</description> <bitOffset>1</bitOffset> </field>
                     <field derivedFrom="EPHSHK" > <name>EPTXEN</name> <description>Transmit enable\n
This bit, when set, enables the endpoint for TX transfers</description> <bitOffset>2</bitOffset> </field>
                     <field derivedFrom="EPHSHK" > <name>EPRXEN</name> <description>Receive enable\n
This bit, when set, enables the endpoint for RX transfers</description> <bitOffset>3</bitOffset> </field>
                     <field>
                        <name>EPCTLDIS</name>
                        <description>Disable control transfers\n
This bit, when set, disables control (SETUP) transfers. \n
When cleared, control transfers are enabled.\n
This applies if and only if the EPRXEN and EPTXEN bits are also set</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Enabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Disabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field derivedFrom="EPCTLDIS" > <name>RETRYDIS</name> <description>Retry disable\n
This is a Host mode only bit and is present in the control register for endpoint 0 (ENDPT0) only.\n
When set this bit causes the host to not retry NAK&apos;ed (Negative Acknowledgement) transactions.\n
When a transaction is NAKed, the BDT PID field is updated with the NAK PID, and the TOKEN_DNE interrupt is set.\n
When this bit is cleared NAKed transactions is retried in hardware.\n
This bit must be set when the host is attempting to poll an interrupt endpoint</description> <bitOffset>6</bitOffset> </field>
                     <field>
                        <name>HOSTWOHUB</name>
                        <description>Directly connect to low speed device\n
This is a Host mode only field and is present in the control register for endpoint 0 (ENDPT0) only.\n
When set the host communicates to a directly connected low speed device. \n
When cleared, the host produces the PRE_PID and then switches to low-speed signalling to send a token to 
a low speed device as required to communicate with a low speed device through a hub</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>Send PRE_PID</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>Direct</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>USBCTRL</name>
               <description>USB Control Register</description>
               <addressOffset>0x100</addressOffset>
               <size>8</size>
               <resetValue>0xC0</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>UARTSEL</name>
                     <description>Selects USB signals to be used as UART signals</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>USB signals not used as UART signals</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>USB signals used as UART signals</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UARTCHLS</name>
                     <description>UART Signal Channel Select</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>USB DP/DM signals used as UART TX/RX</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>USB DP/DM signals used as UART RX/TX</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PDE</name>
                     <description>Weak USB pull-down enable\n
Enables the weak pulldowns on the USB transceiver D+ and D-</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Pull-downs disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Pull-downs enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Suspend Transceiver\n
Places the USB transceiver into the suspend state</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Transceiver active</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Transceiver suspended</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OBSERVE</name>
               <description>USB OTG Observe Register\n
Provides observablity of USB pull-up/down signals</description>
               <addressOffset>0x104</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x50</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>DMPD</name>
                     <description>Observe D- \n
Provides observability of the D- Pull Down enable at the USB transceiver</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>D- pull-down disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>D- pull-down enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPPD</name>
                     <description>Observe D+\n
Provides observability of the D+ Pull Down enable at the USB transceiver</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>D+ pull-down disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>D+ pull-down enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPPU</name>
                     <description>Observe D+\n
Provides observability of the D+ Pull Up enable at the USB transceiver</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>D+ pull-up disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>D+ pull-up enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONTROL</name>
               <description>USB OTG Control Register</description>
               <addressOffset>0x108</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>DPPULLUPNONOTG</name>
                     <description>Non-OTG pull-up control\n
Provides control of the DP Pullup in the USB OTG module, if USB is configured in non-OTG device mode</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>DP Pull-up disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>DP Pull-up enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBTRC0</name>
               <description>USB Transceiver Control Register 0</description>
               <addressOffset>0x10C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>USB_RESUME_INT</name>
                     <description>USB Asynchronous Interrupt Detect</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="USB_RESUME_INT" > <name>SYNC_DET</name> <description>USB Synchronous Interrupt Detect</description> <bitOffset>1</bitOffset> </field>
                  <field>
                     <name>USB_CLK_RECOVERY_INT</name>
                     <description>Combined USB Clock Recovery interrupt status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>VREDG_DET</name>
                     <description>VREGIN Rising Edge Interrupt Detect</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>VREGIN rising edge interrupt has not been detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>VREGIN rising edge interrupt has been detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VFEDG_DET</name>
                     <description>VREGIN Falling Edge Interrupt Detect</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>VREGIN falling edge interrupt has not been detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>VREGIN falling edge interrupt has been detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>USBRESMEN</name>
                     <description>Asynchronous Resume Interrupt Enable\n
This bit, when set, allows the USB module to send an asynchronous wakeup event to the MCU upon detection of resume signaling on the USB bus</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>USBRESET</name>
                     <description>USB Reset\n
Generates a hard reset to the USB_OTG module. After this bit is set and the reset occurs, this bit is automatically cleared</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>write-only</access>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Reset module</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>USBFRMADJUST</name>
               <description>Frame Adjust Register</description>
               <addressOffset>0x114</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>ADJ</name>
                     <description>Frame Adjustment</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
