podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/USB0_MK28F15.svd.xml
            <register>
               <name>MISCCTRL</name>
               <description>Miscellaneous Control Register</description>
               <addressOffset>0x12C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SOFDYNTHLD</name>
                     <description>Dynamic SOF Threshold Compare mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>SOF_TOK interrupt is set when byte times SOF threshold is reached</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>SOF_TOK interrupt is set when 8 byte times SOF threshold is reached or overstepped</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SOFBUSSET</name>
                     <description>SOF_TOK Interrupt Generation Mode Select</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>SOF_TOK interrupt is set according to SOF threshold value</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>SOF_TOK interrupt is set when SOF counter reaches 0</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OWNERRISODIS</name>
                     <description>OWN Error Detect for ISO IN / ISO OUT Disable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>OWN error detect for ISO IN / ISO OUT is not disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>OWN error detect for ISO IN / ISO OUT is disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREDG_EN</name>
                     <description>VREGIN Rising Edge Interrupt Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>VREGIN rising edge interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>VREGIN rising edge interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VFEDG_EN</name>
                     <description>VREGIN Falling Edge Interrupt Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>VREGIN falling edge interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>VREGIN falling edge interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_RECOVER_CTRL</name>
               <description>USB Clock recovery control\n
Signals in this register control the crystal-less USB clock mode in which the internal 
IRC48M oscillator is tuned to match the clock extracted from the incoming USB data stream</description>
               <addressOffset>0x140</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RESTART_IFRTRIM_EN</name>
                     <description>Restart from IFR trim value\n
IRC48 has a default trim fine value whose default value is factory trimmed (the IFR trim value).\n
Clock recover block tracks the accuracy of the clock 48Mhz and keeps updating the trim fine value accordingly</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Trim fine adjustment always works based on the previous updated trim fine value (default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Trim fine restarts from the IFR trim value whenever bus_reset/bus_resume is detected or module disabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RESET_RESUME_ROUGH_EN</name>
                     <description>Reset/resume to rough phase enable\n
The clock recovery block tracks the IRC48Mhz to get an accurate 48Mhz clock. 
It has two phases rough phase and tracking phase.\n
Switch back to rough stage whenever USB bus reset or bus resume occurs</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Always works in tracking phase after the 1st time rough to track transition (default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Go back to rough stage whenever bus reset or bus resume occurs</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CLOCK_RECOVER_EN</name>
                     <description>Crystal-less USB enable\n
This bit must be enabled if user wants to use the crystal-less USB mode for 
the Full Speed USB controller and transceiver.\n
NOTE: This bit should not be set for USB host mode or OTG</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable clock recovery block (default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable clock recovery block</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_RECOVER_IRC_EN</name>
               <description>IRC48M oscillator enable register\n
Controls basic operation of the on-chip IRC48M module used to produce a nominal 
48MHz clocks for USB crystal-less operation and other functions</description>
               <addressOffset>0x144</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>REG_EN</name>
                     <description>IRC48M regulator enable\n
This bit is used to enable the local analog regulator for IRC48Mhz module.\n
This bit must be set if user wants to use the crystal-less USB clock configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>IRC48M local regulator is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>IRC48M local regulator is enabled (default)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IRC_EN</name>
                     <description>IRC48M enable\n
This bit is used to enable the on-chip IRC48Mhz module to generate clocks for crystal-less USB. \n
It can only be used for FS USB device mode operation.\n
This bit must be set before using the crystal-less USB clock configuration</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Disable the IRC48M module (default)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Enable the IRC48M module</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_RECOVER_INT_EN</name>
               <description>Clock recovery combined interrupt enable</description>
               <addressOffset>0x154</addressOffset>
               <size>8</size>
               <resetValue>0x10</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>OVF_ERROR_EN</name>
                     <description>Determines whether OVF_ERROR condition signal is used in generation of USB_CLK_RECOVERY_INT</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The interrupt will be masked</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The interrupt will be enabled (default)</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLK_RECOVER_INT_STATUS</name>
               <description>Clock recovery separated interrupt status\n
A Write operation with value high at 1&apos;b1 on any combination of individual bits 
will clear those bits</description>
               <addressOffset>0x15C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>OVF_ERROR</name>
                     <description>Indicates that the USB clock recovery algorithm has detected 
that the frequency trim adjustment needed for the IRC48M output clock is outside the available 
TRIM_FINE adjustment range for the IRC48M module</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No interrupt is reported</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Unmasked interrupt has been generated</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
